In [3]:
import pandas as pd

In [ ]:
#1.List to series conversions

In [9]:
a=["yo","yolo","yoloheim","yoreka"]
print(pd.Series(a,index=[1,2,3,4]))

1          yo
2        yolo
3    yoloheim
4      yoreka
dtype: object

In [10]:
#or
a=["yo","yolo","yoloheim","yoreka"]
ind=[1,2,3,4]
print(pd.Series(a,index=ind))

1          yo
2        yolo
3    yoloheim
4      yoreka
dtype: object

In [11]:
#2.generate series of dates from May1 to 12th May 2021, both inclusive
#mm-dd-yyyy
dates=pd.date_range(start="2021-05-01",end="2021-05-12",freq='d')
print(pd.Series(dates))

0    2021-05-01
1    2021-05-02
2    2021-05-03
3    2021-05-04
4    2021-05-05
5    2021-05-06
6    2021-05-07
7    2021-05-08
8    2021-05-09
9    2021-05-10
10   2021-05-11
11   2021-05-12
dtype: datetime64[ns]

In [23]:
#3.Convert a dictionary into dataframe and display it
data={
"calories":[619,420,456],
"duration":[50,40,45],
"type":["legs","arms","toes"]
}
b=pd.DataFrame(data,index=["day1","day2","day3"])
print(b)

      calories  duration  type
day1       619        50  legs
day2       420        40  arms
day3       456        45  toes

In [25]:
# 4. 2D list to dataframe

data=[
['Name1','Add1','S3',2000],
['Name2','Add2','S1',1000],
['Name3','Add3','S5',0.001],
['Name4','Add4','S2',2],
]
    
b=pd.DataFrame(data, columns=['Name','Address','Class','Marks'], index=[100,101,102,103])
print(b)

      Name Address Class     Marks
100  Name1    Add1    S3  2000.000
101  Name2    Add2    S1  1000.000
102  Name3    Add3    S5     0.001
103  Name4    Add4    S2     2.000

In [46]:
#5.Read csv into dataframe and display

df=pd.read_csv('data1.csv',index_col=False)
print(df.set_index('SNo'))

       Name  Class  Marks
SNo
1     Name1    MCA   80.0
1     Name2  Btech   90.0
11    Name3  BArch  100.0
8     Name4    Bsc   60.0
6    Billu6  MTech   75.7

In [49]:
#6.Sort dataframe by multiple columns

df=pd.read_csv('data1.csv')
df_sorted=df.sort_values(by = ['SNo','Marks']).set_index('SNo')
print(df_sorted)

       Name  Class  Marks
SNo
1     Name1    MCA   80.0
1     Name2  Btech   90.0
6    Billu6  MTech   75.7
8     Name4    Bsc   60.0
11    Name3  BArch  100.0

In [51]:
#7. Convert custom indexes to default indexes

print(df_sorted.reset_index())

   SNo    Name  Class  Marks
0    1   Name1    MCA   80.0
1    1   Name2  Btech   90.0
2    6  Billu6  MTech   75.7
3    8   Name4    Bsc   60.0
4   11   Name3  BArch  100.0

In [57]:
#8. Print first 2 rows in dataframe

print(df)
rows12=(df.iloc[[0,1],:])
print("Rows 1 and 2 are: \n",rows12)

   SNo    Name  Class  Marks
0    1   Name1    MCA   80.0
1    1   Name2  Btech   90.0
2   11   Name3  BArch  100.0
3    8   Name4    Bsc   60.0
4    6  Billu6  MTech   75.7
Rows 1 and 2 are:
    SNo   Name  Class  Marks
0    1  Name1    MCA   80.0
1    1  Name2  Btech   90.0

In [75]:
#9. Average salary per occupation

data=[
[100,'Name1','Doctor',50000],
[101,'Name2','Engg',60000],
[102,'Name3','Teacher',70000],
[104,'Name4','Astronaut',10],
[105,'Name5','Teacher',30000],
[106,'Name6','Doctor',70000],
[107,'Name7','Engg',45000],
[108,'Name8','Doctor',55000]
]
df_original=pd.DataFrame(data,columns=['SNo','Name','Occupation','Salary'])
print(df_original)

print()

print(df_original.groupby('Occupation')['Salary'].mean())

   SNo   Name Occupation  Salary
0  100  Name1     Doctor   50000
1  101  Name2       Engg   60000
2  102  Name3    Teacher   70000
3  104  Name4  Astronaut      10
4  105  Name5    Teacher   30000
5  106  Name6     Doctor   70000
6  107  Name7       Engg   45000
7  108  Name8     Doctor   55000

Occupation
Astronaut       10.000000
Doctor       58333.333333
Engg         52500.000000
Teacher      50000.000000
Name: Salary, dtype: float64

In [85]:
#10. Given a datafram with NaN values, fill the NaN values with 0.
import numpy as np

data=[
[100,'Name1','Doctor',50000],
[101,'Name2','Engg',np.nan],
[102,'Name3','Teacher',70000],
[104,'Name4','Astronaut',np.nan],
[105,'Name5','Teacher',30000],
[106,'Name6','Doctor',70000],
[107,'Name7','Engg',45000],
[108,'Name8','Doctor',np.nan]
]

print(pd.DataFrame(data,columns=['SNo','Name','Occupation','Salary']))
print()
print(pd.DataFrame(data,columns=['SNo','Name','Occupation','Salary']).fillna(0))

   SNo   Name Occupation   Salary
0  100  Name1     Doctor  50000.0
1  101  Name2       Engg      NaN
2  102  Name3    Teacher  70000.0
3  104  Name4  Astronaut      NaN
4  105  Name5    Teacher  30000.0
5  106  Name6     Doctor  70000.0
6  107  Name7       Engg  45000.0
7  108  Name8     Doctor      NaN

   SNo   Name Occupation   Salary
0  100  Name1     Doctor  50000.0
1  101  Name2       Engg      0.0
2  102  Name3    Teacher  70000.0
3  104  Name4  Astronaut      0.0
4  105  Name5    Teacher  30000.0
5  106  Name6     Doctor  70000.0
6  107  Name7       Engg  45000.0
7  108  Name8     Doctor      0.0

In [84]:
#OR

print(pd.DataFrame(data).replace(np.nan,0))

     0      1          2        3
0  100  Name1     Doctor  50000.0
1  101  Name2       Engg      0.0
2  102  Name3    Teacher  70000.0
3  104  Name4  Astronaut      0.0
4  105  Name5    Teacher  30000.0
5  106  Name6     Doctor  70000.0
6  107  Name7       Engg  45000.0
7  108  Name8     Doctor      0.0

In [92]:
#11. Given is a dataframe showing Company Names (cname)
#and corresponding Profits (profit). 
#Convert the values of Profit column
#such that values in it greater than 0 are set to True and the rest are set to False.

c_data=[
[100,'Name1',50000],
[101,'Name2',55000],
[102,'Name3',-70000],
[104,'Name4',0],
[105,'Name5',30000],
[106,'Name6',70000],
[107,'Name7',45000],
[108,'Name8',35000]
]

c_data_df=(pd.DataFrame(c_data,columns=['SNo','cname','profit']))
print(c_data_df)
print()
c_data_df['profit']=(c_data_df['profit'].apply(lambda x:x >0))
print(c_data_df)

   SNo  cname  profit
0  100  Name1   50000
1  101  Name2   55000
2  102  Name3  -70000
3  104  Name4       0
4  105  Name5   30000
5  106  Name6   70000
6  107  Name7   45000
7  108  Name8   35000

   SNo  cname  profit
0  100  Name1    True
1  101  Name2    True
2  102  Name3   False
3  104  Name4   False
4  105  Name5    True
5  106  Name6    True
6  107  Name7    True
7  108  Name8    True

In [102]:
#12.Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee Name (ename) and Stipend (stipend) 
#and the other dataframe containing Employee ID (eid) and designation of the employee (designation). 
#Output the Dataframe containing Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position (position).


c_data1=[
[100,'Name1',50000],
[101,'Name2',55000],
[102,'Name3',70000],
[104,'Name4',0],
[105,'Name5',30000],
[106,'Name6',70000],
[107,'Name7',45000],
[108,'Name8',35000]
]
c_data2=[
[100,'Manager'],
[101,'Deputy'],
[102,'Regional Manager'],
[104,'Ass to the Regional Manager'],
[105,'SDE'],
[106,'SDE2',],
[107,'Intern',],
[108,'Janitor',]
]
df_cdata1=pd.DataFrame(c_data1,columns=['eid','ename','stipend'])
print(df_cdata1)
print()
df_cdata2=pd.DataFrame(c_data2,columns=['eid','designation'])
print(df_cdata2)

print("\nMerged data from both dataframes:")
merged_cdata=pd.merge(df_cdata1,df_cdata2,how="inner",on="eid")
print(merged_cdata)

   eid  ename  stipend
0  100  Name1    50000
1  101  Name2    55000
2  102  Name3    70000
3  104  Name4        0
4  105  Name5    30000
5  106  Name6    70000
6  107  Name7    45000
7  108  Name8    35000

   eid                  designation
0  100                      Manager
1  101                       Deputy
2  102             Regional Manager
3  104  Ass to the Regional Manager
4  105                          SDE
5  106                         SDE2
6  107                       Intern
7  108                      Janitor

Merged data from both dataframes:
   eid  ename  stipend                  designation
0  100  Name1    50000                      Manager
1  101  Name2    55000                       Deputy
2  102  Name3    70000             Regional Manager
3  104  Name4        0  Ass to the Regional Manager
4  105  Name5    30000                          SDE
5  106  Name6    70000                         SDE2
6  107  Name7    45000                       Intern
7  108  Name8    35000                      Janitor